Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFH064.atdf
         <register caption="" name="PMD4" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="T1MD"/>
            <bitfield mask="0x00000002" name="T2MD"/>
            <bitfield mask="0x00000004" name="T3MD"/>
            <bitfield mask="0x00000008" name="T4MD"/>
            <bitfield mask="0x00000010" name="T5MD"/>
            <bitfield mask="0x00000020" name="T6MD"/>
            <bitfield mask="0x00000040" name="T7MD"/>
            <bitfield mask="0x00000080" name="T8MD"/>
            <bitfield mask="0x00000100" name="T9MD"/>
         </register>
         <register caption="" name="PMD5" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U1MD"/>
            <bitfield mask="0x00000002" name="U2MD"/>
            <bitfield mask="0x00000004" name="U3MD"/>
            <bitfield mask="0x00000008" name="U4MD"/>
            <bitfield mask="0x00000010" name="U5MD"/>
            <bitfield mask="0x00000020" name="U6MD"/>
            <bitfield mask="0x00000100" name="SPI1MD"/>
            <bitfield mask="0x00000200" name="SPI2MD"/>
            <bitfield mask="0x00000400" name="SPI3MD"/>
            <bitfield mask="0x00000800" name="SPI4MD"/>
            <bitfield mask="0x00001000" name="SPI5MD"/>
            <bitfield mask="0x00002000" name="SPI6MD"/>
            <bitfield mask="0x00010000" name="I2C1MD"/>
            <bitfield mask="0x00020000" name="I2C2MD"/>
            <bitfield mask="0x00040000" name="I2C3MD"/>
            <bitfield mask="0x00080000" name="I2C4MD"/>
            <bitfield mask="0x00100000" name="I2C5MD"/>
            <bitfield mask="0x01000000" name="USBMD"/>
            <bitfield mask="0x10000000" name="CAN1MD"/>
            <bitfield mask="0x20000000" name="CAN2MD"/>
         </register>
         <register caption="" name="PMD6" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RTCCMD"/>
            <bitfield mask="0x00000100" name="REFO1MD"/>
            <bitfield mask="0x00000200" name="REFO2MD"/>
            <bitfield mask="0x00000400" name="REFO3MD"/>
            <bitfield mask="0x00000800" name="REFO4MD"/>
            <bitfield mask="0x00010000" name="PMPMD"/>
            <bitfield mask="0x00020000" name="EBIMD"/>
            <bitfield mask="0x00800000" name="SQI1MD"/>
            <bitfield mask="0x10000000" name="ETHMD"/>
         </register>
         <register caption="" name="PMD7" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="DMAMD"/>
            <bitfield mask="0x00100000" name="RNGMD"/>
            <bitfield mask="0x00400000" name="CRYPTMD"/>
         </register>
         <register caption="Permission Group Configuration Register" name="CFGPG" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CPUPG"/>
            <bitfield mask="0x00000030" name="DMAPG"/>
            <bitfield mask="0x00000300" name="USBPG"/>
            <bitfield mask="0x00003000" name="CAN1PG"/>
            <bitfield mask="0x0000C000" name="CAN2PG"/>
            <bitfield mask="0x00030000" name="ETHPG"/>
            <bitfield mask="0x00300000" name="SQI1PG"/>
            <bitfield mask="0x00C00000" name="FCPG"/>
            <bitfield caption="Crypto Engine Permission Group bits" mask="0x03000000" name="CRYPTPG" values="CFGPG__CRYPTPG"/>
            <bitfield mask="0xC0000000" name="ICD1PG"/>
         </register>
      </register-group>
      <value-group caption="Silicon Revision" name="DEVID__VER">
         <value caption="Revision A1" name="" value="0x10000000"/>
         <value caption="Revision A3" name="" value="0x30000000"/>
         <value caption="Revision B2" name="" value="0x60000000"/>
      </value-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1"/>
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trace Output Enable bit" name="CFGCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1"/>
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1"/>
         <value caption="Disable the JTAG port" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash ECC Configuration bits" name="CFGCON__ECCCON">
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are writable)" name="" value="0x3"/>
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are locked)" name="" value="0x2"/>
         <value caption="Dynamic Flash ECC is enabled (ECCCON bits are locked)" name="" value="0x1"/>
         <value caption="Flash ECC is enabled (ECCCON bits are locked; disables word Flash writes)" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Suspend Sleep Enable bit(1)" name="CFGCON__USBSSEN">
         <value caption="USB PHY clock is shut down when Sleep mode is active" name="" value="0x1"/>
         <value caption="USB PHY clock continues to run when Sleep is active" name="" value="0x0"/>
      </value-group>
      <value-group caption="Permission Group Lock bit(1)" name="CFGCON__PGLOCK">
         <value caption="Permission Group registers are locked. Writes to PG registers are not allowed" name="" value="0x1"/>
         <value caption="Permission Group registers are not locked. Writes to PG registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Module Disable bit(1)" name="CFGCON__PMDLOCK">
         <value caption="Peripheral module is locked. Writes to PMD registers are not allowed" name="" value="0x1"/>
         <value caption="Peripheral module is not locked. Writes to PMD registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Pin Select Lock bit(1)" name="CFGCON__IOLOCK">
         <value caption="Peripheral Pin Select is locked. Writes to PPS registers are not allowed" name="" value="0x1"/>
         <value caption="Peripheral Pin Select is not locked. Writes to PPS registers are allowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Compare Alternate Clock Selection bit(1)" name="CFGCON__OCACLK">
         <value caption="Output Compare modules use an alternative Timer pair as their timebase clock" name="" value="0x1"/>
         <value caption="All Output Compare modules use Timer2/3 as their timebase clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Capture Alternate Clock Selection bit(1)" name="CFGCON__ICACLK">
         <value caption="Input Capture modules use an alternative Timer pair as their timebase clock" name="" value="0x1"/>
         <value caption="All Input Capture modules use Timer2/3 as their timebase clock" name="" value="0x0"/>
      </value-group>
