Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFH064.atdf
      <value-group caption="CPU Arbitration Priority to SRAM When Servicing an Interrupt bit(1)" name="CFGCON__CPUPRI">
         <value caption="CPU gets High Priority access to SRAM" name="" value="0x1"/>
         <value caption="CPU uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Read and DMA Write Arbitration Priority to SRAM bit(1)" name="CFGCON__DMAPRI">
         <value caption="DMA gets High Priority access to SRAM" name="" value="0x1"/>
         <value caption="DMA uses Least Recently Serviced Arbitration (same as other initiators)" name="" value="0x0"/>
      </value-group>
      <value-group caption="I/O Analog Charge Pump Enable bit" name="CFGCON__IOANCPEN">
         <value caption="Charge pump is enabled" name="" value="0x80"/>
         <value caption="Charge pump is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Crypto Engine Permission Group bits" name="CFGPG__CRYPTPG">
         <value caption="Initiator is assigned to Permission Group 3" name="" value="0x3"/>
         <value caption="Initiator is assigned to Permission Group 2" name="" value="0x2"/>
         <value caption="Initiator is assigned to Permission Group 1" name="" value="0x1"/>
         <value caption="Initiator is assigned to Permission Group 0" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00866" name="CMP" version="2">
      <register-group name="CMP">
         <register caption="Comparator Control Register" name="CM1CON" initval="0x000000C3" offset="0x0" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Select bits for Comparator" mask="0x00000003" name="CCH" values="CM1CON__CCH"/>
            <bitfield caption="Comparator Positive Input Configure bit" mask="0x00000010" name="CREF" values="CM1CON__CREF"/>
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM1CON__EVPOL"/>
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM1CON__COUT"/>
            <bitfield mask="0x00001000" name="CLPWR"/>
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM1CON__CPOL"/>
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM1CON__COE"/>
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM1CON__ON"/>
         </register>
         <register caption="Comparator Control Register" name="CM2CON" initval="0x000000C3" offset="0x10" rw="RW" size="4">
            <bitfield caption="Comparator Negative Input Select bits for Comparator" mask="0x00000003" name="CCH" values="CM2CON__CCH"/>
            <bitfield caption="Comparator Positive Input Configure bit" mask="0x00000010" name="CREF" values="CM2CON__CREF"/>
            <bitfield caption="Interrupt Event Polarity Select bits" mask="0x000000C0" name="EVPOL" values="CM2CON__EVPOL"/>
            <bitfield caption="Comparator Output bit" mask="0x00000100" name="COUT" values="CM2CON__COUT"/>
            <bitfield mask="0x00001000" name="CLPWR"/>
            <bitfield caption="Comparator Output Inversion bit" mask="0x00002000" name="CPOL" values="CM2CON__CPOL"/>
            <bitfield caption="Comparator Output Enable bit" mask="0x00004000" name="COE" values="CM2CON__COE"/>
            <bitfield caption="Comparator ON bit" mask="0x00008000" name="ON" values="CM2CON__ON"/>
         </register>
         <register caption="Comparator Status Register" name="CMSTAT" offset="0x60" rw="RW" size="4">
            <bitfield caption="Comparator Output bit" mask="0x00000001" name="C1OUT" values="CMSTAT__C1OUT"/>
            <bitfield caption="Comparator Output bit" mask="0x00000002" name="C2OUT" values="CMSTAT__C2OUT"/>
            <bitfield mask="0x00000004" name="C3OUT"/>
            <bitfield mask="0x00000008" name="C4OUT"/>
            <bitfield mask="0x00000010" name="C5OUT"/>
            <bitfield mask="0x00000020" name="C6OUT"/>
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="CMSTAT__SIDL"/>
         </register>
      </register-group>
      <value-group caption="Comparator Negative Input Select bits for Comparator" name="CM1CON__CCH">
         <value caption="Comparator inverting input is connected to the IVREF" name="" value="0x3"/>
         <value caption="Comparator inverting input is connected to the CxIND pin" name="" value="0x2"/>
         <value caption="Comparator inverting input is connected to the CxINC pin" name="" value="0x1"/>
         <value caption="Comparator inverting input is connected to the CxINB pin" name="" value="0x0"/>
      </value-group>
      <value-group caption="Comparator Positive Input Configure bit" name="CM1CON__CREF">
         <value caption="Comparator non-inverting input is connected to the internal CVref" name="" value="0x1"/>
         <value caption="Comparator non-inverting input is connected to the CxINA pin" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Event Polarity Select bits" name="CM1CON__EVPOL">
         <value caption="Comparator interrupt is generated on a low-to-high or high-to-low transition of the comparator output" name="" value="0x3"/>
         <value caption="Comparator interrupt is generated on a high-to-low transition of the comparator output" name="" value="0x2"/>
         <value caption="Comparator interrupt is generated on a low-to-high transition of the comparator output" name="" value="0x1"/>
         <value caption="Comparator interrupt generation is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Comparator Output bit" name="CM1CON__COUT">
         <value caption="Output of the Comparator is a 1" name="" value="0x1"/>
         <value caption="Output of the Comparator is a 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Comparator Output Inversion bit" name="CM1CON__CPOL">
         <value caption="Output is inverted" name="" value="0x1"/>
         <value caption="Output is not inverted" name="" value="0x0"/>
      </value-group>
      <value-group caption="Comparator Output Enable bit" name="CM1CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1"/>
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0"/>
      </value-group>
      <value-group caption="Comparator ON bit" name="CM1CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1"/>
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0"/>
      </value-group>
