Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFH064.atdf
         <register caption="Interrupt Priority Control Registe" name="IPC11" offset="0x1f0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCIS"/>
            <bitfield mask="0x0000001C" name="ADCIP"/>
            <bitfield mask="0x00000300" name="ADCFIFOIS"/>
            <bitfield mask="0x00001C00" name="ADCFIFOIP"/>
            <bitfield mask="0x00030000" name="ADCDC1IS"/>
            <bitfield mask="0x001C0000" name="ADCDC1IP"/>
            <bitfield mask="0x03000000" name="ADCDC2IS"/>
            <bitfield mask="0x1C000000" name="ADCDC2IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC12" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCDC3IS"/>
            <bitfield mask="0x0000001C" name="ADCDC3IP"/>
            <bitfield mask="0x00000300" name="ADCDC4IS"/>
            <bitfield mask="0x00001C00" name="ADCDC4IP"/>
            <bitfield mask="0x00030000" name="ADCDC5IS"/>
            <bitfield mask="0x001C0000" name="ADCDC5IP"/>
            <bitfield mask="0x03000000" name="ADCDC6IS"/>
            <bitfield mask="0x1C000000" name="ADCDC6IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC13" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCDF1IS"/>
            <bitfield mask="0x0000001C" name="ADCDF1IP"/>
            <bitfield mask="0x00000300" name="ADCDF2IS"/>
            <bitfield mask="0x00001C00" name="ADCDF2IP"/>
            <bitfield mask="0x00030000" name="ADCDF3IS"/>
            <bitfield mask="0x001C0000" name="ADCDF3IP"/>
            <bitfield mask="0x03000000" name="ADCDF4IS"/>
            <bitfield mask="0x1C000000" name="ADCDF4IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC14" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCDF5IS"/>
            <bitfield mask="0x0000001C" name="ADCDF5IP"/>
            <bitfield mask="0x00000300" name="ADCDF6IS"/>
            <bitfield mask="0x00001C00" name="ADCDF6IP"/>
            <bitfield mask="0x00030000" name="ADCFLTIS"/>
            <bitfield mask="0x001C0000" name="ADCFLTIP"/>
            <bitfield mask="0x03000000" name="ADCD0IS"/>
            <bitfield mask="0x1C000000" name="ADCD0IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC15" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD1IS"/>
            <bitfield mask="0x0000001C" name="ADCD1IP"/>
            <bitfield mask="0x00000300" name="ADCD2IS"/>
            <bitfield mask="0x00001C00" name="ADCD2IP"/>
            <bitfield mask="0x00030000" name="ADCD3IS"/>
            <bitfield mask="0x001C0000" name="ADCD3IP"/>
            <bitfield mask="0x03000000" name="ADCD4IS"/>
            <bitfield mask="0x1C000000" name="ADCD4IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC16" offset="0x240" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD5IS"/>
            <bitfield mask="0x0000001C" name="ADCD5IP"/>
            <bitfield mask="0x00000300" name="ADCD6IS"/>
            <bitfield mask="0x00001C00" name="ADCD6IP"/>
            <bitfield mask="0x00030000" name="ADCD7IS"/>
            <bitfield mask="0x001C0000" name="ADCD7IP"/>
            <bitfield mask="0x03000000" name="ADCD8IS"/>
            <bitfield mask="0x1C000000" name="ADCD8IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC17" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD9IS"/>
            <bitfield mask="0x0000001C" name="ADCD9IP"/>
            <bitfield mask="0x00000300" name="ADCD10IS"/>
            <bitfield mask="0x00001C00" name="ADCD10IP"/>
            <bitfield mask="0x00030000" name="ADCD11IS"/>
            <bitfield mask="0x001C0000" name="ADCD11IP"/>
            <bitfield mask="0x03000000" name="ADCD12IS"/>
            <bitfield mask="0x1C000000" name="ADCD12IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC18" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD13IS"/>
            <bitfield mask="0x0000001C" name="ADCD13IP"/>
            <bitfield mask="0x00000300" name="ADCD14IS"/>
            <bitfield mask="0x00001C00" name="ADCD14IP"/>
            <bitfield mask="0x00030000" name="ADCD15IS"/>
            <bitfield mask="0x001C0000" name="ADCD15IP"/>
            <bitfield mask="0x03000000" name="ADCD16IS"/>
            <bitfield mask="0x1C000000" name="ADCD16IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC19" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD17IS"/>
            <bitfield mask="0x0000001C" name="ADCD17IP"/>
            <bitfield mask="0x00000300" name="ADCD18IS"/>
            <bitfield mask="0x00001C00" name="ADCD18IP"/>
            <bitfield mask="0x00030000" name="ADCD19IS"/>
            <bitfield mask="0x001C0000" name="ADCD19IP"/>
            <bitfield mask="0x03000000" name="ADCD20IS"/>
            <bitfield mask="0x1C000000" name="ADCD20IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC25" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="ADCD41IS"/>
            <bitfield mask="0x0000001C" name="ADCD41IP"/>
            <bitfield mask="0x00000300" name="ADCD42IS"/>
            <bitfield mask="0x00001C00" name="ADCD42IP"/>
            <bitfield mask="0x00030000" name="ADCD43IS"/>
            <bitfield mask="0x001C0000" name="ADCD43IP"/>
            <bitfield mask="0x03000000" name="ADCD44IS"/>
            <bitfield mask="0x1C000000" name="ADCD44IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC26" offset="0x2e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CPCIS"/>
            <bitfield mask="0x0000001C" name="CPCIP"/>
            <bitfield mask="0x00000300" name="CFDCIS"/>
            <bitfield mask="0x00001C00" name="CFDCIP"/>
            <bitfield mask="0x00030000" name="SBIS"/>
            <bitfield mask="0x001C0000" name="SBIP"/>
            <bitfield mask="0x03000000" name="CRPTIS"/>
            <bitfield mask="0x1C000000" name="CRPTIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC27" offset="0x2f0" rw="RW" size="4">
            <bitfield mask="0x00000300" name="SPI1EIS"/>
            <bitfield mask="0x00001C00" name="SPI1EIP"/>
            <bitfield mask="0x00030000" name="SPI1RXIS"/>
            <bitfield mask="0x001C0000" name="SPI1RXIP"/>
            <bitfield mask="0x03000000" name="SPI1TXIS"/>
            <bitfield mask="0x1C000000" name="SPI1TXIP"/>
         </register>
